# შექმენით სია, შეიტანეთ 5 მნიშვნელობა, შემდეგ 3 მნიშვნელობა შეცვალეთ და გამოიტანეთ სია.
# ============================================

# data = ['nika', 'gio', 'luka', 'levani', 17, 16]
# data[0] = 'elene'
# data[4] = 20 
# data[5] = 10
# print (data)
# ===============================================
#  შექმენით რიცხვების სია და ერთამენთს დაუმატეთ და გამოიტანეთ საბოლოო ჯამი.
# ===============================================
numbers = [17, 20, 1, 5, 10, 9, 2]

print (numbers[0] + numbers[1] + numbers[2] + numbers[3] + numbers[4] 
       + numbers[5] + numbers[6])

# ===============================================
# შექმენით სტრინგების სია, გადაეცით 6 სიტყვა და შემდგომ ეს სიტყვები დაუმატეთ ერთმანეთს და გამოიტანეთ ფრაზა.

# ===============================================

words = ['me', 'var', 'nika', 'gzirishvili', 'var', 17, 'wlis', 'da', 'vswavlob', 'goashi']
print (words[0] + words[1] + words[2] + words[3] + words[4] + str(words[5]) + words[6] + words[7] + words[8] + words[9])