# დავალება 1. შექმენით სია და შეიტანეთ 10 სხვადასხვა მონაცემთა ტიპის მნიშვნელობა, შემდეგ 5 მონაცემს  შეუცვალეთ   მნიშვნელობა და შემდეგ დაპრინტეთ მთლიანი სია.
# ========================================================================================================================

# data = ['nika', 'giorgi', 13, 28, 13.0, 56.8, True, False, 'elene', 34]

# data[0] = 'mari'
# data[7] = True
# data[6] = False
# data[2] = 99
# data[4] = 66.9
# print(data)

# # დავალება 2. შექმენი სია, რომელიც შეიცავს რიცხვებს. დაწერე კოდი, რომელიც გამოითვლის ამ სიის ელემენტების ჯამს და დაბეჭდავს შედეგს.
# # ============================================================================================================================================

# numbers = [10, 55, 98, 10, 4.5, 0.1, 32.4]

# print (numbers[0] + numbers[1] + numbers[2] + numbers[3] + numbers[4] + numbers[5] + numbers[6] )


# დავალება 3. შექმენი სია რიცხვებით. დაწერე კოდი, რომელიც თითოეული ელემენტის გაორმაგებულ მნიშვნელობას შეიცავს ახალ სიაში და დაბეჭდავს მას. 
# ============================================================================================================================================

# num = 0
# numbers = [10, 55, 98, 10, 4.5, 0.1, 32.4]
# for i in numbers:
#     print (i * 2)


# დავალება 4. შექმენი სია რიცხვებით და დაწერე კოდი, რომელიც გამოითვლის სიის ყველა ელემენტის ნამრავლს და დაბეჭდავს შედეგს.
# ============================================================================================================================================


numbers = [10, 55, 98, 10,]
num = 1
for i in numbers:
    num *=i
print (num)
