#დავალება 1: მომხმარებელს შემოატანინეთ რიცხვი, შემდეგ კი for ლუპის დახმარებით გავლეთ დიაპაზონი მომხმარებლის შემოტანილ რიცხვამდე.
x = int(input('enter you number :'))
for i in range(0, x) :
    print(i)

#დავალება 2: 10-დან 20-მდე გამოტანეთ ყველა რიცხვი, while ციკლის დახმარებით
i = 9
while i < 19:
    i = i + 1
    print(i)

#დავალება 3: while ციკლის დახმარებით გამოტანეთ 0-დან 100-მდე, მხოლოდ ლუწი რიცხვები
i = 0
while i < 100:
    i = i + 2
    print(i)

#დავალება: მომხმარებესლ შემოატანინეთ სახელი, მომხმარებლის სახელი თუ არ უდრის თქვენს სახელს, კიდევ გაიმეოროს კითხა, თუ უდიან მომხმარებლის შემოტანილი 
# სახელი და თქვენი სახელი, მაშინ გაცერდეს იტერაცია.
user_name = input('enter name: ')
while user_name != 'nika':
    user_name = input('enter name: ')
