# num = [1,2,3,4,5,6,7,8,9,10]


# # დაჭერით სია, რომ მიიღოთ პირველი 5 ელემენტი და დაბეჭდეთ ისინი.
# print(num[:5])

# # დაჭერით სია ბოლო 3 ელემენტის მისაღებად და დაბეჭდეთ ისინი.
# print(num[-3:])

# # დაჭერით სია, რომ მიიღოთ ყოველი მეორე ელემენტი სიიდან და დაბეჭდეთ იგი.
# print(num[::2])

# #  შექმენით 6 სტრიქონის სია, რომლებიც წარმოადგენენ სხვადასხვა ხილს: 

fruit = ['ვაშლი', 'ბანანი', 'ალუბალი', 'თარიღი', 'ლეღვი', 'ყურძენი']

# #შეცვალეთ სია ჭრის გამოყენებით და ამობეჭდეთ შებრუნებული სია.
# print(fruit[::-1])

#შეცვალეთ შუა ორი ხილი ['კივი', 'ცაცხვი'] სიის ჭრის გამოყენებით და დაბეჭდეთ განახლებული სია.
fruit[2] = 'კივი'
fruit[3] = 'ცაცხვი'
print(fruit[:])
