# დავალება: შექმენით ლისტი და შეცვალეთ შიგნით მყოფი მნიშვნელობები შეცვალე, შემდეგ კი დაპრინტეთ განახლებული სია.

list = [1,2,3,4,5,6,7]
list[0] = 11
list[1] = 12
list[2] = 13
list[3] = 14
list[4] = 15
list[5] = 16
list[6] = 17
print(list)



# დავალებვა1: შექმენით სია სადაც ჩაწერთ თამაშების სახელებს, შემდეგ კი ეს სახელები შეცვალეთ პროგრამირების ენებით.



game_name = ['CS:GO', 'ARK', 'Battlefield','GTA5', 'War Thunder']

game_name[0] = 'CSS'
game_name[1] = 'HTML'
game_name[2] = 'java'
game_name[3] = 'Python'
game_name[4] = 'javascript'


print (game_name)



# დავალება2: შექმენით ლისტი და შემდეგ ეს ლისტი დაპრინტეთ უკუღმა


list=[1,2,3,4,5,6,7,8]

print(list[-1::-1])


# დაფვალება3: შექმენით ლისტი სადაც ჩაწერთ რიცხვებს 0 დან 20-მდე, და შემდეგ დაპრინტეთ მხოლოდ კენტი რიცხვები.

list=[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20]
print (list[1::2])